# ConnectorManager Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..ConnectorManager Property
Connector Class See Also
---
The connector manager of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorManager ConnectorManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```

Visual C++
---
```text
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown on failure to get connector manager. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace